analyze -library WORK -format vhdl {./DLX_syn/00-myTypes.vhd}
analyze -library WORK -format vhdl {./DLX_syn/01-FF.vhd}
analyze -library WORK -format vhdl {./DLX_syn/02-FFD.vhd}
analyze -library WORK -format vhdl {./DLX_syn/03-FFD_RST.vhd}
analyze -library WORK -format vhdl {./DLX_syn/04-Register_Generic.vhd}
analyze -library WORK -format vhdl {./DLX_syn/05-Register_Generic_rst.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.c-DLX_Fetch_Stage.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.a-MASK_AND_ALIGN.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.b-DLX_RF.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.d-SHIFT_AND_ALIGN.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.e-LOGIC_JMP.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.f-FORWARDING_UNIT.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.g-EXT_IMM.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/01-fa.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/05-Carry_look_ahead.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/04-PG_Network.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/03-PG.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/02-G.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.g-Comparator/01-Carry_network.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.g-Comparator/02-Equality_PG_network.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.g-Comparator/03-Equality_check_unit.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.g-Comparator/04-Carry_out_network.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.g-Comparator/06-zero_detector.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.g-Comparator/05-Comparator.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.f-Array_multiplier/01-Half_adder.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.f-Array_multiplier/02-FullAdder.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.f-Array_multiplier/03-FastAdder.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.f-Array_multiplier/04-Array_multiplier.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.h-Cellular_array_divider/01-Division_cell.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.h-Cellular_array_divider/02-Division_cell_row.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.h-Cellular_array_divider/03-Cellular_array_divider.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/000-constants.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/03-rca.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/02-nd2.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/01-iv.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/04-rca_gen.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/05-mux21_generic.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/05-mux21_generic.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/08-mux_8to1.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/07-mux2to1.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/06-mux21.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/10-Shifter_gen.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/09-shifter.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/11-Carry_Select_Block.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/11-Carry_Select_Block.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/13-CLA_Sparse_Tree_Generator.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/12-Carry_Select_Sum_Generator.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/14-Pentium_IV_Adder.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/15-Booth_Multiplier.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/16-Adder_subctractor.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/17-integer_comparator.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/18-logic_unit.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.core/19-Multiplier_unit.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.a-ALU_Integer.vhd}
analyze -library WORK -format vhdl {{./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.b-ALU_Converter unit.core/01-Generic_normlization_unit.vhd}}
analyze -library WORK -format vhdl {{./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.b-ALU_Converter unit.core/01-Generic_normlization_unit.vhd}}
analyze -library WORK -format vhdl {{./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.b-ALU_Converter unit.core/07-Integer_to_floating_point_single_precision.vhd} {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.b-ALU_Converter unit.core/06-Integer_to_floating_point_double.vhd} {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.b-ALU_Converter unit.core/05-Floating_point_single_precision_to_integer.vhd} {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.b-ALU_Converter unit.core/04-Floating_point_single_precision_to_double.vhd} {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.b-ALU_Converter unit.core/03-Floating_point_double_precision_to_single.vhd} {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.b-ALU_Converter unit.core/02-Floating_point_double_precision_to_integer.vhd}}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.a-Add_sub/01-Alignment_compare_E.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.a-Add_sub/04-Generic_normalization_double_unit.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.a-Add_sub/03-mantissa_add_sub.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.a-Add_sub/02-Mantissa_shifter.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.a-Add_sub/04-Generic_normalization_double_unit.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.a-Add_sub/05-Double_add_sub.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.a-Add_sub/06-Double_cmp_add_sub.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-ALU_FP_Single.core/a.b.c.e.a-add_sub/04-postnormalization_ADD_SUB_single.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-ALU_FP_Single.core/a.b.c.e.a-add_sub/03-mantissa_add_sub.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-ALU_FP_Single.core/a.b.c.e.a-add_sub/02-Mantissa_shifter.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-ALU_FP_Single.core/a.b.c.e.a-add_sub/01-Alignment_compare_E_ADD_single.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-ALU_FP_Single.core/a.b.c.e.a-add_sub/05-IEEE_754_floating_add_sub.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-ALU_FP_Single.core/a.b.c.e.a-add_sub/06-IEEE_754_Add_Cmp_unit.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.b-Divider/03-Generic_normalization_double_DIV_unit.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.b-Divider/02-Mantissa_divider.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.b-Divider/01-Exponent_subctrator_fp_double.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.b-Divider/03-Generic_normalization_double_DIV_unit.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.b-Divider/03-Generic_normalization_double_DIV_unit.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.b-Divider/04-Double_Floating_Point_Divider.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.d-Mul/03-Mantissa_multiplier.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.d-Mul/02-Generic_normalization_double_MUL_unit.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.d-Mul/01-Exponent_Adder.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-ALU_FP_Double.core/a.b.c.d.d-Mul/04-Double_Floating_Point_Multiplier.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-ALU_FP_Single.core/a.b.c.e.b-div/03-Exponent_subctrator_fp_single.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-ALU_FP_Single.core/a.b.c.e.b-div/02-postnormalization_DIV_unit.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-ALU_FP_Single.core/a.b.c.e.b-div/01-Mantissa_divider.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-ALU_FP_Single.core/a.b.c.e.b-div/04-IEEE_754_Fast_Divider.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-ALU_FP_Single.core/a.b.c.e.c-mul/03-postnormalization_multiplier_unit_single.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-ALU_FP_Single.core/a.b.c.e.c-mul/02-Mantissa_multiplier.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-ALU_FP_Single.core/a.b.c.e.c-mul/01-Exponent_Adder.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-ALU_FP_Single.core/a.b.c.e.c-mul/04-IEEE_754_Floating_Point_Multiplier.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.e-Floating_Point_Single_Precision_unit.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.d-Floating_Point_Double_Precision_Unit.vhd ./DLX_syn/a.b-Datapath.core/a.b.c-ALU.core/a.b.c.b-Converter_unit.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-Datapath.core/a.b.c-ALU.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.b-DataPath.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a.a-CONTROL_UNIT.vhd}
analyze -library WORK -format vhdl {./DLX_syn/a-DLX.vhd}

elaborate DLX -architecture STRUCTURAL -library WORK

compile -exact_map

#SAVE UNCONSTRAINED DESIGN.
write -hierarchy -format ddc -output ./SynthesisDLX_UNCONSTRAINED.ddc
write -hierarchy -format verilog -output ./PostSynthesisDLX_UNCONSTRAINED.v

#REPORT AREA AND POWER.
report_area > AREA_UNCONSTRAINED.txt
report_power > POWER_UNCONSTRAINED.txt

#WARNING: TIMIG REPORTS REQUIRES MANY HOURS.

#REPORT TIMING ALU.
uplevel #0 { report_timing  -from { ID_EX_MEM_WB_stages/EX_ALU/OPB[48] ID_EX_MEM_WB_stages/EX_ALU/OPA[29] ID_EX_MEM_WB_stages/EX_ALU/OPB[17] ID_EX_MEM_WB_stages/EX_ALU/OPB[40] ID_EX_MEM_WB_stages/EX_ALU/OPA[21] ID_EX_MEM_WB_stages/EX_ALU/OPB[0] ID_EX_MEM_WB_stages/EX_ALU/OPB[63] ID_EX_MEM_WB_stages/EX_ALU/OPB[8] ID_EX_MEM_WB_stages/EX_ALU/OPB[38] ID_EX_MEM_WB_stages/EX_ALU/OPA[19] ID_EX_MEM_WB_stages/EX_ALU/OPA[42] ID_EX_MEM_WB_stages/EX_ALU/OPA[11] ID_EX_MEM_WB_stages/EX_ALU/OPB[30] ID_EX_MEM_WB_stages/EX_ALU/OPA[6] ID_EX_MEM_WB_stages/EX_ALU/OPB[53] ID_EX_MEM_WB_stages/EX_ALU/OPB[28] ID_EX_MEM_WB_stages/EX_ALU/OPA[32] ID_EX_MEM_WB_stages/EX_ALU/OPA[55] ID_EX_MEM_WB_stages/EX_ALU/OPB[20] ID_EX_MEM_WB_stages/EX_ALU/OPB[18] ID_EX_MEM_WB_stages/EX_ALU/OPA[22] ID_EX_MEM_WB_stages/EX_ALU/OPB[1] ID_EX_MEM_WB_stages/EX_ALU/OPB[45] ID_EX_MEM_WB_stages/EX_ALU/OPA[47] ID_EX_MEM_WB_stages/EX_ALU/OPB[10] ID_EX_MEM_WB_stages/EX_ALU/OPB[9] ID_EX_MEM_WB_stages/EX_ALU/OPA[12] ID_EX_MEM_WB_stages/EX_ALU/OPB[35] ID_EX_MEM_WB_stages/EX_ALU/OPA[7] ID_EX_MEM_WB_stages/EX_ALU/OPA[37] ID_EX_MEM_WB_stages/EX_ALU/OPB[54] ID_EX_MEM_WB_stages/EX_ALU/OPA[56] ID_EX_MEM_WB_stages/EX_ALU/OPB[25] ID_EX_MEM_WB_stages/EX_ALU/OPA[27] ID_EX_MEM_WB_stages/EX_ALU/OPB[2] ID_EX_MEM_WB_stages/EX_ALU/OPB[46] ID_EX_MEM_WB_stages/EX_ALU/OPA[48] ID_EX_MEM_WB_stages/EX_ALU/OPB[15] ID_EX_MEM_WB_stages/EX_ALU/OPA[0] ID_EX_MEM_WB_stages/EX_ALU/OPA[17] ID_EX_MEM_WB_stages/EX_ALU/OPA[40] ID_EX_MEM_WB_stages/EX_ALU/OPB[61] ID_EX_MEM_WB_stages/EX_ALU/OPA[63] ID_EX_MEM_WB_stages/EX_ALU/OPA[8] ID_EX_MEM_WB_stages/EX_ALU/OPB[36] ID_EX_MEM_WB_stages/EX_ALU/OPA[38] ID_EX_MEM_WB_stages/EX_ALU/OPB[59] ID_EX_MEM_WB_stages/EX_ALU/OPB[51] ID_EX_MEM_WB_stages/EX_ALU/OPA[30] ID_EX_MEM_WB_stages/EX_ALU/OPA[53] ID_EX_MEM_WB_stages/EX_ALU/OPB[26] ID_EX_MEM_WB_stages/EX_ALU/OPA[28] ID_EX_MEM_WB_stages/EX_ALU/OPA[20] ID_EX_MEM_WB_stages/EX_ALU/OPB[43] ID_EX_MEM_WB_stages/EX_ALU/OPB[16] ID_EX_MEM_WB_stages/EX_ALU/OPA[1] ID_EX_MEM_WB_stages/EX_ALU/OPA[18] ID_EX_MEM_WB_stages/EX_ALU/OPB[62] ID_EX_MEM_WB_stages/EX_ALU/OPA[45] ID_EX_MEM_WB_stages/EX_ALU/OPB[33] ID_EX_MEM_WB_stages/EX_ALU/OPA[9] ID_EX_MEM_WB_stages/EX_ALU/OPA[10] ID_EX_MEM_WB_stages/EX_ALU/OPB[3] ID_EX_MEM_WB_stages/EX_ALU/OPB[52] ID_EX_MEM_WB_stages/EX_ALU/OPA[35] ID_EX_MEM_WB_stages/EX_ALU/OPA[54] ID_EX_MEM_WB_stages/EX_ALU/OPB[23] ID_EX_MEM_WB_stages/EX_ALU/OPB[44] ID_EX_MEM_WB_stages/EX_ALU/OPA[25] ID_EX_MEM_WB_stages/EX_ALU/OPB[13] ID_EX_MEM_WB_stages/EX_ALU/OPA[2] ID_EX_MEM_WB_stages/EX_ALU/OPA[46] ID_EX_MEM_WB_stages/EX_ALU/OPB[4] ID_EX_MEM_WB_stages/EX_ALU/OPB[34] ID_EX_MEM_WB_stages/EX_ALU/OPA[15] ID_EX_MEM_WB_stages/EX_ALU/OPB[57] ID_EX_MEM_WB_stages/EX_ALU/OPA[61] ID_EX_MEM_WB_stages/EX_ALU/OPA[36] ID_EX_MEM_WB_stages/EX_ALU/OPA[59] ID_EX_MEM_WB_stages/EX_ALU/OPB[24] ID_EX_MEM_WB_stages/EX_ALU/OPA[51] ID_EX_MEM_WB_stages/EX_ALU/OPB[49] ID_EX_MEM_WB_stages/EX_ALU/OPA[26] ID_EX_MEM_WB_stages/EX_ALU/OPB[14] ID_EX_MEM_WB_stages/EX_ALU/OPB[41] ID_EX_MEM_WB_stages/EX_ALU/OPB[60] ID_EX_MEM_WB_stages/EX_ALU/OPA[43] ID_EX_MEM_WB_stages/EX_ALU/OPB[5] ID_EX_MEM_WB_stages/EX_ALU/OPB[39] ID_EX_MEM_WB_stages/EX_ALU/OPA[16] ID_EX_MEM_WB_stages/EX_ALU/OPB[58] ID_EX_MEM_WB_stages/EX_ALU/OPA[62] ID_EX_MEM_WB_stages/EX_ALU/OPB[31] ID_EX_MEM_WB_stages/EX_ALU/OPA[3] ID_EX_MEM_WB_stages/EX_ALU/OPB[50] ID_EX_MEM_WB_stages/EX_ALU/OPA[33] ID_EX_MEM_WB_stages/EX_ALU/OPB[29] ID_EX_MEM_WB_stages/EX_ALU/OPA[52] ID_EX_MEM_WB_stages/EX_ALU/OPB[21] ID_EX_MEM_WB_stages/EX_ALU/OPA[23] ID_EX_MEM_WB_stages/EX_ALU/OPB[19] ID_EX_MEM_WB_stages/EX_ALU/OPB[42] ID_EX_MEM_WB_stages/EX_ALU/OPA[44] ID_EX_MEM_WB_stages/EX_ALU/OPB[11] ID_EX_MEM_WB_stages/EX_ALU/OPB[6] ID_EX_MEM_WB_stages/EX_ALU/OPA[13] ID_EX_MEM_WB_stages/EX_ALU/OPB[32] ID_EX_MEM_WB_stages/EX_ALU/OPA[4] ID_EX_MEM_WB_stages/EX_ALU/OPB[55] ID_EX_MEM_WB_stages/EX_ALU/OPA[34] ID_EX_MEM_WB_stages/EX_ALU/OPA[57] ID_EX_MEM_WB_stages/EX_ALU/OPB[22] ID_EX_MEM_WB_stages/EX_ALU/OPB[47] ID_EX_MEM_WB_stages/EX_ALU/OPA[24] ID_EX_MEM_WB_stages/EX_ALU/OPA[49] ID_EX_MEM_WB_stages/EX_ALU/OPB[12] ID_EX_MEM_WB_stages/EX_ALU/OPB[7] ID_EX_MEM_WB_stages/EX_ALU/OPB[37] ID_EX_MEM_WB_stages/EX_ALU/OPA[14] ID_EX_MEM_WB_stages/EX_ALU/OPA[41] ID_EX_MEM_WB_stages/EX_ALU/OPA[60] ID_EX_MEM_WB_stages/EX_ALU/OPA[5] ID_EX_MEM_WB_stages/EX_ALU/OPB[56] ID_EX_MEM_WB_stages/EX_ALU/OPA[39] ID_EX_MEM_WB_stages/EX_ALU/OPA[58] ID_EX_MEM_WB_stages/EX_ALU/OPB[27] ID_EX_MEM_WB_stages/EX_ALU/OPA[31] ID_EX_MEM_WB_stages/EX_ALU/OPA[50] } -to { ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[57] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[44] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[53] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[30] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[3] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[16] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[27] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[7] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[23] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[50] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[38] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[41] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[34] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[58] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[20] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[61] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[49] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[0] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[17] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[54] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[4] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[45] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[13] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[28] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[8] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[31] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[24] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[42] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[10] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[51] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[39] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[35] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[62] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[1] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[18] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[59] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[21] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[5] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[46] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[14] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[55] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[32] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[9] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[29] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[25] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[52] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[11] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[36] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[2] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[47] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[22] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[6] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[43] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[19] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[56] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[15] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[63] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[40] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[26] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[37] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[12] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[33] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[60] ID_EX_MEM_WB_stages/EX_ALU/ALU_Out[48] } -path full -delay max -nworst 1 -max_paths 1 -significant_digits 2 -sort_by group } > ALU_TIMING.txt
#REPORT TIMING FROM RAM OUT TO ALU OUT REGISTER.
uplevel #0 { report_timing  -from { DATAOUT_RAM[16] DATAOUT_RAM[9] DATAOUT_RAM[47] DATAOUT_RAM[57] DATAOUT_RAM[12] DATAOUT_RAM[43] DATAOUT_RAM[62] DATAOUT_RAM[38] DATAOUT_RAM[53] DATAOUT_RAM[1] DATAOUT_RAM[34] DATAOUT_RAM[30] DATAOUT_RAM[26] DATAOUT_RAM[17] DATAOUT_RAM[6] DATAOUT_RAM[22] DATAOUT_RAM[13] DATAOUT_RAM[48] DATAOUT_RAM[63] DATAOUT_RAM[58] DATAOUT_RAM[44] DATAOUT_RAM[54] DATAOUT_RAM[2] DATAOUT_RAM[40] DATAOUT_RAM[39] DATAOUT_RAM[50] DATAOUT_RAM[27] DATAOUT_RAM[35] DATAOUT_RAM[23] DATAOUT_RAM[18] DATAOUT_RAM[31] DATAOUT_RAM[14] DATAOUT_RAM[3] DATAOUT_RAM[10] DATAOUT_RAM[7] DATAOUT_RAM[49] DATAOUT_RAM[60] DATAOUT_RAM[59] DATAOUT_RAM[45] DATAOUT_RAM[28] DATAOUT_RAM[55] DATAOUT_RAM[41] DATAOUT_RAM[36] DATAOUT_RAM[24] DATAOUT_RAM[51] DATAOUT_RAM[32] DATAOUT_RAM[20] DATAOUT_RAM[19] DATAOUT_RAM[4] DATAOUT_RAM[15] DATAOUT_RAM[8] DATAOUT_RAM[11] DATAOUT_RAM[46] DATAOUT_RAM[37] DATAOUT_RAM[61] DATAOUT_RAM[56] DATAOUT_RAM[0] DATAOUT_RAM[42] DATAOUT_RAM[33] DATAOUT_RAM[29] DATAOUT_RAM[52] DATAOUT_RAM[25] DATAOUT_RAM[5] DATAOUT_RAM[21] } -to { ID_EX_MEM_WB_stages/ALU_REG/data_in[47] ID_EX_MEM_WB_stages/ALU_REG/data_in[43] ID_EX_MEM_WB_stages/ALU_REG/data_in[38] ID_EX_MEM_WB_stages/ALU_REG/data_in[61] ID_EX_MEM_WB_stages/ALU_REG/data_in[56] ID_EX_MEM_WB_stages/ALU_REG/data_in[34] ID_EX_MEM_WB_stages/ALU_REG/data_in[26] ID_EX_MEM_WB_stages/ALU_REG/data_in[52] ID_EX_MEM_WB_stages/ALU_REG/data_in[30] ID_EX_MEM_WB_stages/ALU_REG/data_in[22] ID_EX_MEM_WB_stages/ALU_REG/data_in[17] ID_EX_MEM_WB_stages/ALU_REG/data_in[13] ID_EX_MEM_WB_stages/ALU_REG/data_in[7] ID_EX_MEM_WB_stages/ALU_REG/data_in[48] ID_EX_MEM_WB_stages/ALU_REG/data_in[3] ID_EX_MEM_WB_stages/ALU_REG/data_in[44] ID_EX_MEM_WB_stages/ALU_REG/data_in[39] ID_EX_MEM_WB_stages/ALU_REG/data_in[62] ID_EX_MEM_WB_stages/ALU_REG/data_in[40] ID_EX_MEM_WB_stages/ALU_REG/data_in[57] ID_EX_MEM_WB_stages/ALU_REG/data_in[35] ID_EX_MEM_WB_stages/ALU_REG/data_in[27] ID_EX_MEM_WB_stages/ALU_REG/data_in[0] ID_EX_MEM_WB_stages/ALU_REG/data_in[53] ID_EX_MEM_WB_stages/ALU_REG/data_in[31] ID_EX_MEM_WB_stages/ALU_REG/data_in[23] ID_EX_MEM_WB_stages/ALU_REG/data_in[18] ID_EX_MEM_WB_stages/ALU_REG/data_in[14] ID_EX_MEM_WB_stages/ALU_REG/data_in[8] ID_EX_MEM_WB_stages/ALU_REG/data_in[49] ID_EX_MEM_WB_stages/ALU_REG/data_in[10] ID_EX_MEM_WB_stages/ALU_REG/data_in[4] ID_EX_MEM_WB_stages/ALU_REG/data_in[45] ID_EX_MEM_WB_stages/ALU_REG/data_in[63] ID_EX_MEM_WB_stages/ALU_REG/data_in[41] ID_EX_MEM_WB_stages/ALU_REG/data_in[58] ID_EX_MEM_WB_stages/ALU_REG/data_in[36] ID_EX_MEM_WB_stages/ALU_REG/data_in[28] ID_EX_MEM_WB_stages/ALU_REG/data_in[1] ID_EX_MEM_WB_stages/ALU_REG/data_in[54] ID_EX_MEM_WB_stages/ALU_REG/data_in[32] ID_EX_MEM_WB_stages/ALU_REG/data_in[24] ID_EX_MEM_WB_stages/ALU_REG/data_in[19] ID_EX_MEM_WB_stages/ALU_REG/data_in[50] ID_EX_MEM_WB_stages/ALU_REG/data_in[20] ID_EX_MEM_WB_stages/ALU_REG/data_in[15] ID_EX_MEM_WB_stages/ALU_REG/data_in[9] ID_EX_MEM_WB_stages/ALU_REG/data_in[11] ID_EX_MEM_WB_stages/ALU_REG/data_in[5] ID_EX_MEM_WB_stages/ALU_REG/data_in[46] ID_EX_MEM_WB_stages/ALU_REG/data_in[42] ID_EX_MEM_WB_stages/ALU_REG/data_in[59] ID_EX_MEM_WB_stages/ALU_REG/data_in[37] ID_EX_MEM_WB_stages/ALU_REG/data_in[29] ID_EX_MEM_WB_stages/ALU_REG/data_in[60] ID_EX_MEM_WB_stages/ALU_REG/data_in[2] ID_EX_MEM_WB_stages/ALU_REG/data_in[55] ID_EX_MEM_WB_stages/ALU_REG/data_in[33] ID_EX_MEM_WB_stages/ALU_REG/data_in[25] ID_EX_MEM_WB_stages/ALU_REG/data_in[51] ID_EX_MEM_WB_stages/ALU_REG/data_in[21] ID_EX_MEM_WB_stages/ALU_REG/data_in[16] ID_EX_MEM_WB_stages/ALU_REG/data_in[12] ID_EX_MEM_WB_stages/ALU_REG/data_in[6] } -path full -delay max -nworst 1 -max_paths 1 -significant_digits 2 -sort_by group } > CRITICAL_PATH_UNCONSTRAINED.txt

###################################################SYNTHESIS USING DESIGN CONSTRAINT#########################################################

elaborate DLX -architecture STRUCTURAL -library WORK
#SET CLOCK CONSTRAINED.
set period 65

create_clock -name "CLK" -period $period

report_clock

set_max_delay $period -from { DATAOUT_RAM[16] DATAOUT_RAM[9] DATAOUT_RAM[47] DATAOUT_RAM[57] DATAOUT_RAM[12] DATAOUT_RAM[43] DATAOUT_RAM[62] DATAOUT_RAM[38] DATAOUT_RAM[53] DATAOUT_RAM[1] DATAOUT_RAM[34] DATAOUT_RAM[30] DATAOUT_RAM[26] DATAOUT_RAM[17] DATAOUT_RAM[6] DATAOUT_RAM[22] DATAOUT_RAM[13] DATAOUT_RAM[48] DATAOUT_RAM[63] DATAOUT_RAM[58] DATAOUT_RAM[44] DATAOUT_RAM[54] DATAOUT_RAM[2] DATAOUT_RAM[40] DATAOUT_RAM[39] DATAOUT_RAM[50] DATAOUT_RAM[27] DATAOUT_RAM[35] DATAOUT_RAM[23] DATAOUT_RAM[18] DATAOUT_RAM[31] DATAOUT_RAM[14] DATAOUT_RAM[3] DATAOUT_RAM[10] DATAOUT_RAM[7] DATAOUT_RAM[49] DATAOUT_RAM[60] DATAOUT_RAM[59] DATAOUT_RAM[45] DATAOUT_RAM[28] DATAOUT_RAM[55] DATAOUT_RAM[41] DATAOUT_RAM[36] DATAOUT_RAM[24] DATAOUT_RAM[51] DATAOUT_RAM[32] DATAOUT_RAM[20] DATAOUT_RAM[19] DATAOUT_RAM[4] DATAOUT_RAM[15] DATAOUT_RAM[8] DATAOUT_RAM[11] DATAOUT_RAM[46] DATAOUT_RAM[37] DATAOUT_RAM[61] DATAOUT_RAM[56] DATAOUT_RAM[0] DATAOUT_RAM[42] DATAOUT_RAM[33] DATAOUT_RAM[29] DATAOUT_RAM[52] DATAOUT_RAM[25] DATAOUT_RAM[5] DATAOUT_RAM[21] } -to { ID_EX_MEM_WB_stages/ALU_REG/data_in[47] ID_EX_MEM_WB_stages/ALU_REG/data_in[43] ID_EX_MEM_WB_stages/ALU_REG/data_in[38] ID_EX_MEM_WB_stages/ALU_REG/data_in[61] ID_EX_MEM_WB_stages/ALU_REG/data_in[56] ID_EX_MEM_WB_stages/ALU_REG/data_in[34] ID_EX_MEM_WB_stages/ALU_REG/data_in[26] ID_EX_MEM_WB_stages/ALU_REG/data_in[52] ID_EX_MEM_WB_stages/ALU_REG/data_in[30] ID_EX_MEM_WB_stages/ALU_REG/data_in[22] ID_EX_MEM_WB_stages/ALU_REG/data_in[17] ID_EX_MEM_WB_stages/ALU_REG/data_in[13] ID_EX_MEM_WB_stages/ALU_REG/data_in[7] ID_EX_MEM_WB_stages/ALU_REG/data_in[48] ID_EX_MEM_WB_stages/ALU_REG/data_in[3] ID_EX_MEM_WB_stages/ALU_REG/data_in[44] ID_EX_MEM_WB_stages/ALU_REG/data_in[39] ID_EX_MEM_WB_stages/ALU_REG/data_in[62] ID_EX_MEM_WB_stages/ALU_REG/data_in[40] ID_EX_MEM_WB_stages/ALU_REG/data_in[57] ID_EX_MEM_WB_stages/ALU_REG/data_in[35] ID_EX_MEM_WB_stages/ALU_REG/data_in[27] ID_EX_MEM_WB_stages/ALU_REG/data_in[0] ID_EX_MEM_WB_stages/ALU_REG/data_in[53] ID_EX_MEM_WB_stages/ALU_REG/data_in[31] ID_EX_MEM_WB_stages/ALU_REG/data_in[23] ID_EX_MEM_WB_stages/ALU_REG/data_in[18] ID_EX_MEM_WB_stages/ALU_REG/data_in[14] ID_EX_MEM_WB_stages/ALU_REG/data_in[8] ID_EX_MEM_WB_stages/ALU_REG/data_in[49] ID_EX_MEM_WB_stages/ALU_REG/data_in[10] ID_EX_MEM_WB_stages/ALU_REG/data_in[4] ID_EX_MEM_WB_stages/ALU_REG/data_in[45] ID_EX_MEM_WB_stages/ALU_REG/data_in[63] ID_EX_MEM_WB_stages/ALU_REG/data_in[41] ID_EX_MEM_WB_stages/ALU_REG/data_in[58] ID_EX_MEM_WB_stages/ALU_REG/data_in[36] ID_EX_MEM_WB_stages/ALU_REG/data_in[28] ID_EX_MEM_WB_stages/ALU_REG/data_in[1] ID_EX_MEM_WB_stages/ALU_REG/data_in[54] ID_EX_MEM_WB_stages/ALU_REG/data_in[32] ID_EX_MEM_WB_stages/ALU_REG/data_in[24] ID_EX_MEM_WB_stages/ALU_REG/data_in[19] ID_EX_MEM_WB_stages/ALU_REG/data_in[50] ID_EX_MEM_WB_stages/ALU_REG/data_in[20] ID_EX_MEM_WB_stages/ALU_REG/data_in[15] ID_EX_MEM_WB_stages/ALU_REG/data_in[9] ID_EX_MEM_WB_stages/ALU_REG/data_in[11] ID_EX_MEM_WB_stages/ALU_REG/data_in[5] ID_EX_MEM_WB_stages/ALU_REG/data_in[46] ID_EX_MEM_WB_stages/ALU_REG/data_in[42] ID_EX_MEM_WB_stages/ALU_REG/data_in[59] ID_EX_MEM_WB_stages/ALU_REG/data_in[37] ID_EX_MEM_WB_stages/ALU_REG/data_in[29] ID_EX_MEM_WB_stages/ALU_REG/data_in[60] ID_EX_MEM_WB_stages/ALU_REG/data_in[2] ID_EX_MEM_WB_stages/ALU_REG/data_in[55] ID_EX_MEM_WB_stages/ALU_REG/data_in[33] ID_EX_MEM_WB_stages/ALU_REG/data_in[25] ID_EX_MEM_WB_stages/ALU_REG/data_in[51] ID_EX_MEM_WB_stages/ALU_REG/data_in[21] ID_EX_MEM_WB_stages/ALU_REG/data_in[16] ID_EX_MEM_WB_stages/ALU_REG/data_in[12] ID_EX_MEM_WB_stages/ALU_REG/data_in[6] }

compile -map_effort high

report_area > AREA_CONSTRAINED.txt
report_power > POWER_CONSTRAINED.txt

#SAVE RESULTS.
write -hierarchy -format ddc -output ./SynthesisDLX_CONSTRAINED.ddc

write -hierarchy -format verilog -output ./postSynthesysConstrainedDLX.v

#CRITICAL PATH FORM RAM OUT TO ALU REGISTER OUT GIVEN BY THE FEEDBACK OF THE DATA FORWARDING.
uplevel #0 { report_timing  -from { DATAOUT_RAM[16] DATAOUT_RAM[9] DATAOUT_RAM[47] DATAOUT_RAM[57] DATAOUT_RAM[12] DATAOUT_RAM[43] DATAOUT_RAM[62] DATAOUT_RAM[38] DATAOUT_RAM[53] DATAOUT_RAM[1] DATAOUT_RAM[34] DATAOUT_RAM[30] DATAOUT_RAM[26] DATAOUT_RAM[17] DATAOUT_RAM[6] DATAOUT_RAM[22] DATAOUT_RAM[13] DATAOUT_RAM[48] DATAOUT_RAM[63] DATAOUT_RAM[58] DATAOUT_RAM[44] DATAOUT_RAM[54] DATAOUT_RAM[2] DATAOUT_RAM[40] DATAOUT_RAM[39] DATAOUT_RAM[50] DATAOUT_RAM[27] DATAOUT_RAM[35] DATAOUT_RAM[23] DATAOUT_RAM[18] DATAOUT_RAM[31] DATAOUT_RAM[14] DATAOUT_RAM[3] DATAOUT_RAM[10] DATAOUT_RAM[7] DATAOUT_RAM[49] DATAOUT_RAM[60] DATAOUT_RAM[59] DATAOUT_RAM[45] DATAOUT_RAM[28] DATAOUT_RAM[55] DATAOUT_RAM[41] DATAOUT_RAM[36] DATAOUT_RAM[24] DATAOUT_RAM[51] DATAOUT_RAM[32] DATAOUT_RAM[20] DATAOUT_RAM[19] DATAOUT_RAM[4] DATAOUT_RAM[15] DATAOUT_RAM[8] DATAOUT_RAM[11] DATAOUT_RAM[46] DATAOUT_RAM[37] DATAOUT_RAM[61] DATAOUT_RAM[56] DATAOUT_RAM[0] DATAOUT_RAM[42] DATAOUT_RAM[33] DATAOUT_RAM[29] DATAOUT_RAM[52] DATAOUT_RAM[25] DATAOUT_RAM[5] DATAOUT_RAM[21] } -to { ID_EX_MEM_WB_stages/ALU_REG/data_in[47] ID_EX_MEM_WB_stages/ALU_REG/data_in[43] ID_EX_MEM_WB_stages/ALU_REG/data_in[38] ID_EX_MEM_WB_stages/ALU_REG/data_in[61] ID_EX_MEM_WB_stages/ALU_REG/data_in[56] ID_EX_MEM_WB_stages/ALU_REG/data_in[34] ID_EX_MEM_WB_stages/ALU_REG/data_in[26] ID_EX_MEM_WB_stages/ALU_REG/data_in[52] ID_EX_MEM_WB_stages/ALU_REG/data_in[30] ID_EX_MEM_WB_stages/ALU_REG/data_in[22] ID_EX_MEM_WB_stages/ALU_REG/data_in[17] ID_EX_MEM_WB_stages/ALU_REG/data_in[13] ID_EX_MEM_WB_stages/ALU_REG/data_in[7] ID_EX_MEM_WB_stages/ALU_REG/data_in[48] ID_EX_MEM_WB_stages/ALU_REG/data_in[3] ID_EX_MEM_WB_stages/ALU_REG/data_in[44] ID_EX_MEM_WB_stages/ALU_REG/data_in[39] ID_EX_MEM_WB_stages/ALU_REG/data_in[62] ID_EX_MEM_WB_stages/ALU_REG/data_in[40] ID_EX_MEM_WB_stages/ALU_REG/data_in[57] ID_EX_MEM_WB_stages/ALU_REG/data_in[35] ID_EX_MEM_WB_stages/ALU_REG/data_in[27] ID_EX_MEM_WB_stages/ALU_REG/data_in[0] ID_EX_MEM_WB_stages/ALU_REG/data_in[53] ID_EX_MEM_WB_stages/ALU_REG/data_in[31] ID_EX_MEM_WB_stages/ALU_REG/data_in[23] ID_EX_MEM_WB_stages/ALU_REG/data_in[18] ID_EX_MEM_WB_stages/ALU_REG/data_in[14] ID_EX_MEM_WB_stages/ALU_REG/data_in[8] ID_EX_MEM_WB_stages/ALU_REG/data_in[49] ID_EX_MEM_WB_stages/ALU_REG/data_in[10] ID_EX_MEM_WB_stages/ALU_REG/data_in[4] ID_EX_MEM_WB_stages/ALU_REG/data_in[45] ID_EX_MEM_WB_stages/ALU_REG/data_in[63] ID_EX_MEM_WB_stages/ALU_REG/data_in[41] ID_EX_MEM_WB_stages/ALU_REG/data_in[58] ID_EX_MEM_WB_stages/ALU_REG/data_in[36] ID_EX_MEM_WB_stages/ALU_REG/data_in[28] ID_EX_MEM_WB_stages/ALU_REG/data_in[1] ID_EX_MEM_WB_stages/ALU_REG/data_in[54] ID_EX_MEM_WB_stages/ALU_REG/data_in[32] ID_EX_MEM_WB_stages/ALU_REG/data_in[24] ID_EX_MEM_WB_stages/ALU_REG/data_in[19] ID_EX_MEM_WB_stages/ALU_REG/data_in[50] ID_EX_MEM_WB_stages/ALU_REG/data_in[20] ID_EX_MEM_WB_stages/ALU_REG/data_in[15] ID_EX_MEM_WB_stages/ALU_REG/data_in[9] ID_EX_MEM_WB_stages/ALU_REG/data_in[11] ID_EX_MEM_WB_stages/ALU_REG/data_in[5] ID_EX_MEM_WB_stages/ALU_REG/data_in[46] ID_EX_MEM_WB_stages/ALU_REG/data_in[42] ID_EX_MEM_WB_stages/ALU_REG/data_in[59] ID_EX_MEM_WB_stages/ALU_REG/data_in[37] ID_EX_MEM_WB_stages/ALU_REG/data_in[29] ID_EX_MEM_WB_stages/ALU_REG/data_in[60] ID_EX_MEM_WB_stages/ALU_REG/data_in[2] ID_EX_MEM_WB_stages/ALU_REG/data_in[55] ID_EX_MEM_WB_stages/ALU_REG/data_in[33] ID_EX_MEM_WB_stages/ALU_REG/data_in[25] ID_EX_MEM_WB_stages/ALU_REG/data_in[51] ID_EX_MEM_WB_stages/ALU_REG/data_in[21] ID_EX_MEM_WB_stages/ALU_REG/data_in[16] ID_EX_MEM_WB_stages/ALU_REG/data_in[12] ID_EX_MEM_WB_stages/ALU_REG/data_in[6] } -path full -delay max -nworst 1 -max_paths 1 -significant_digits 2 -sort_by group } > CRITICAL_PATH_CONSTRAINED.txt
